src/cf/Documents/ПланОтдела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПланОтдела</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПланОтдела</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидПлана</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланНаМесяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦельНаМесяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СертификатыСК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СертификатыПРОФ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаНарядов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднееВремяНаНаряд</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ПланОтдела/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Сотрудники.Очистить();

	Запрос = Новый Запрос;
	Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	КатегорииСотрудниковСрезПоследних.Категория.НормаНарядов КАК НормаНарядов
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииСотрудников.СрезПоследних(&ПериодДокумента, ) КАК КатегорииСотрудниковСрезПоследних
		|		ПО Сотрудники.Ссылка = КатегорииСотрудниковСрезПоследних.Сотрудник
		|#УсловиеОтбора";
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Текст = СтрЗаменить(Текст,"#УсловиеОтбора","ГДЕ Сотрудники.Подразделение В ИЕРАРХИИ(&Подразделение)");
		Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Иначе
		Текст = СтрЗаменить(Текст,"#УсловиеОтбора","");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПериодДокумента", КонецМесяца(Объект.КонецПериода));

	Запрос.Текст = Текст;
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = Объект.Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);		
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СотрудникиПланНаМесяцПриИзменении(Элемент)
	
	
	ТекущаяСтрока = Элементы.Сотрудники.ТекущиеДанные;
	//+++Ева 15.02 Заполняем по умолчанию цель = +25% к плану  
	ТекущаяСтрока.ЦельНаМесяц = ТекущаяСтрока.ПланНаМесяц*1.25;
	
	СотрудникиПланЦельНаМесяцПриИзменении(ТекущаяСтрока);
	
КонецПроцедуры


&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Элемент = ДобавитьМесяц(ЭтотОбъект.Элементы.ПериодРегистрации,Направление);
КонецПроцедуры


&НаКлиенте
Процедура УстановитьИнтервал(Команда)
		
	ОбщегоНазначенияУТКлиент.РедактироватьПериод(Объект, 
		Новый Структура("ДатаНачала, ДатаОкончания", "НачалоПериода", "КонецПериода"));

КонецПроцедуры


&НаКлиенте
Процедура СотрудникиЦельНаМесяцПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПланЦельНаМесяцПриИзменении(ТекущаяСтрока)
		
	Если ТекущаяСтрока.ПланНаМесяц > 0 и ТекущаяСтрока.НормаНарядов > 0 Тогда		
		ТекущаяСтрока.СреднееВремяНаНаряд = ТекущаяСтрока.ПланНаМесяц / ТекущаяСтрока.НормаНарядов;		
	Иначе
		ТекущаяСтрока.СреднееВремяНаНаряд = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиНормаНарядовПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Сотрудники.ТекущиеДанные;
	
	СотрудникиПланЦельНаМесяцПриИзменении(ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Сотрудники.ТекущиеДанные;	
	ТекущаяСтрока.НормаНарядов = ЗаполнитьНормуНарядовСотрудника(ТекущаяСтрока.Сотрудник);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНормуНарядовСотрудника(Сотрудник)
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КатегорииСотрудниковСрезПоследних.Категория.НормаНарядов КАК НормаНарядов
		|ИЗ
		|	РегистрСведений.КатегорииСотрудников.СрезПоследних(&ПериодДокумента, Сотрудник = &Сотрудник) КАК КатегорииСотрудниковСрезПоследних";
	

	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);	
	Запрос.УстановитьПараметр("ПериодДокумента", КонецМесяца(Объект.КонецПериода));
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НормаНарядов;
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура СотрудникиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РассчитатьИтогСреднегоВремениПоНаряду();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РассчитатьИтогСреднегоВремениПоНаряду();

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтогСреднегоВремениПоНаряду()
	
	ЭтаФорма.ИтогСреднегоВремениПоНаряду = ?(Объект.Сотрудники.Итог("НормаНарядов")>0,Формат(Объект.Сотрудники.Итог("ПланНаМесяц")/Объект.Сотрудники.Итог("НормаНарядов"),"ЧДЦ=2"),0);

КонецПроцедуры
